/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Einer]@ der folgenden Werte zutreffen";
"%[All]@ of the following are true" = "%1$[Alle]@ der folgenden Werte zutreffen";
"%[None]@ of the following are true" = "%1$[Keiner]@ der folgenden Werte zutreffen";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Art]@ ist %2$[Beliebig]@";
"%[Kind]@ is %[applications]@" = "%1$[Art]@ ist %2$[Programm]@";
"%[Kind]@ is %[documents]@" = "%1$[Art]@ ist %2$[Dokument]@";
"%[Kind]@ is %[folders]@" = "%1$[Art]@ ist %2$[Ordner]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Art]@ ist %2$[Bild]@ %3$[Alle]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Art]@ ist %2$[Bild]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Art]@ ist %2$[Bild]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Art]@ ist %2$[Bild]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Art]@ ist %2$[Bild]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Art]@ ist %2$[Bild]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Art]@ ist %2$[Musik]@ %3$[Alle]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Art]@ ist %2$[Musik]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Art]@ ist %2$[Musik]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Art]@ ist %2$[Musik]@ %3$[Gekauft]@";
"%[Kind]@ is %[PDF]@" = "%1$[Art]@ ist %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Art]@ ist %2$[Präsentation]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Art]@ ist %2$[Text]@ %3$[Alle]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Art]@ ist %2$[Text]@ %3$[Reiner Text]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Art]@ ist %2$[Text]@ %3$[Formatierter Text]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Art]@ ist %2$[Text]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Art]@ ist %2$[Text]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Art]@ ist %2$[Text]@ %3$[Quellcode]@";
"%[Kind]@ is %[movies]@" = "%1$[Art]@ ist %2$[Film]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Art]@ ist %2$[Andere]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ ist %2$[innerhalb der letzten]@ %3$@ %4$[Tage]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ ist %2$[innerhalb der letzten]@ %3$@ %4$[Wochen]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ ist %2$[innerhalb der letzten]@ %3$@ %4$[Monate]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ ist %2$[innerhalb der letzten]@ %3$@ %4$[Jahre]@";
"%@ is %[exactly]@ %@" = "%1$@ ist %2$[genau]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ ist %2$[vor]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ ist %2$[nach]@ %3$@";
"%@ is %[today]@" = "%1$@ ist %2$[heute]@";
"%@ is %[yesterday]@" = "%1$@ ist %2$[gestern]@";
"%@ is %[this week]@" = "%1$@ ist %2$[diese Woche]@";
"%@ is %[this month]@" = "%1$@ ist %2$[diesen Monat]@";
"%@ is %[this year]@" = "%1$@ ist %2$[dieses Jahr]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[enthält]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[beginnt mit]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[endet mit]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[ist]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[stimmt überein mit]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[Beliebig]@";
"%@ %[yes]@" = "%1$@ %2$[Ja]@";
"%@ %[no]@" = "%1$@ %2$[Nein]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Sichtbarkeit]@ ist %2$[sichtbar]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Sichtbarkeit]@ ist %2$[unsichtbar]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Sichtbarkeit]@ ist %2$[sichtbar oder unsichtbar]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Logischer Ausdruck]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Dateisuffix]@ %2$[ist]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[ist gleich]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[ist größer als]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[ist weniger als]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[ist nicht]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ enthält %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[ist gleich]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[ist gleich]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[ist gleich]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[ist weniger als]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[ist weniger als]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[ist weniger als]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[ist größer als]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[ist größer als]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[ist größer als]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[ist nicht]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[ist nicht]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[ist nicht]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[ist gleich]@ %3$@ Stunden %4$@ Minuten %5$@ Sekunden";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[ist weniger als]@ %3$@ Stunden %4$@ Minuten %5$@ Sekunden";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[ist größer als]@ %3$@ Stunden %4$@ Minuten %5$@ Sekunden";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[ist nicht]@ %3$@ Stunden %4$@ Minuten %5$@ Sekunden";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[mit dem Text übereinstimmende Objekte]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[Systemdateien]@ %2$[einschließen]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[Systemdateien]@ %2$[nicht einschließen]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight-Objekte]@ %2$[einschließen]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight-Objekte]@ %2$[nicht einschließen]@";

